package com.pongjack.BinaryTree;

public class RBTree<K extends Comparable<? super K>,V> {
    /**
     * 你为什么要当码农啊，这个职业真的太累了
     * 你要学习的东西，不是固定的那一点，你要学习
     * 数据库，各种高级语言，编译原理，操作系统，计算机网络
     *前端的要学习各种框架，一日一更新，不断保持新鲜度
     * 加班是这个行业最正常的现象，如果你不加班，n那么很可能你不是一个职业IT
     * 死的早，真的不是随便说说的，如果你想成为大牛，那你的逻辑思维绝对不能差
     * 你还是有时间陪孩子配家人吗？
     * 你还想做自己的想做的休闲娱乐的事吗？
     * 告诉你，那个时间你会被加班以及不断地学习的时间占据
     * 就说这个红黑树，你知道这里面的有多深吗？
     * 你以为看看博客，看看文献就记住了
     * 这不是古诗，背下来，了解大致意思就可以了
     * 你做项目的时候，总会被各种bug搞到头炸
     * 你还用会运维，真以为那些运维工程师，就甘心给你运维，你自己不会，不调试正确，别人才没有那个闲时间帮你调试呢
     * 你还要有各种优化数据库额技能
     * 你还要学习各种大数据的内容
     * 你天天对着电脑，发现一天只能了解皮毛
     * 了解皮毛的好处，就是可能很快的做出项目
     * 了解皮毛的坏处，可能就是一个bug调试一天，找各种文献，测试不下千次
     * 你以为你只要了解后台，或者前端的知识就足够了？
     * 你错了
     * 你要成为全栈，因为很多创业公司，没有那个薪资，请这么多人
     * 你还要做各种PPT，Word文档
     * 一个文档够你写一个礼拜的
     * 各种作图软件
     * 各种调试工具
     * 你全部要会。
     *
     * 不过既然入了这行，就要一日如百日，好好学习
     * 你会因为半天的工作量，然后发现成功运行，而欢欢不可终日
     * 你会因为你学会一个新的知识点，让你信心倍增
     * 你会因为一个算法的accpt
     * 而能吃下两碗饭
     * 你会因为你的电脑，换了一个更牛逼的显卡，而跃跃欲试
     * 你会因为自己成为一个计算机高手，而从中获益
     * 虽然工资可能达不到你要求
     * 可是你会因为自己沉浸其中而高兴半天
     */
    
}
